import re


def print_info():
    str = print('Выберите необходимые действия: \n'
                 'Показать все записи - 1\n'
                 'Показать сотрудника по фамилии - 2\n'
                 'Показать сотрудников по должности - 3\n'
                 'Показать сотрудников по заработной плате - 4\n'
                 'Добавить сотрудника  - 5\n'
                 'Добавить данные сотрудника  - 6\n'
                 'Удалить запись  - 7\n'
                 'Закончить работу  - 8\n'
                 )
    return str

